#### RailAngledJoinOption Enumeration

---

|  |
| --- |
| See Also |

The angled joins of the rails.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailAngledJoinOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailAngledJoinOption ``` |

| Visual C++ |
| --- |
| ``` public enum class RailAngledJoinOption ``` |

# Members

| Member name | Description |
| --- | --- |
| AddVerticalOrHorizontalSegments | Add vertical or horizontal segments. |
| NoConnector | No connector. |

# See Also

Autodesk.Revit.DB.Architecture Namespace